package io.wexchain.dccchainservice.domain


data class CertProcess(
		val processCode: String,
		val token: String,
		val website: String,
		val type: String?,
		val needSecRequest: Boolean
){
	fun wrapCode(): Code? {
		return Code.values().firstOrNull { it.code == processCode }
	}

	enum class Code(
			val code:String,
			val message:String
	){
		CODE_10001("10001","再次输入短信验证码"),//二次短信验证使用，跳转：4.1.4-2-3 二次验证
		CODE_10002("10002","输入短信验证码"),//一次短信验证使用，跳转：4.1.4-2-2 一次验证
		CODE_10003("10003","密码错误"),//服务密码错误，停留在4.1.4-2-1授权运营商认证页面提示信息：服务密码错误
		CODE_10004("10004","短信验证码错误"),//停留在当前页。 页面提示信息：短信验证码错误，系统已自动重新下发
		CODE_10006("10006","短信验证码失效系统已自动重新下发"),//停留在当前页。 页面提示信息：短信验证码失效，系统已自动重新下发
		CODE_10007("10007","简单密码或初始密码无法登录"),//停留在当前页。 页面提示信息：服务密码过于简单，请去运营商官网重新设置后再提交
		CODE_10008("10008","开始采集行为数据"),//授权成功，停留在当前页。同时高亮手机运营商认证图标
		CODE_10017("10017","请用本机发送CXXD至10001获取查询详单的验证码"),//不会自动下发验证码，需要提示用户手动发送短信再获取验证码（吉林电信），跳转：4.1.4-2-2 一次验证 页面提示信息：请使用本机发送CXXD至10001获取查询详单的验证码
		CODE_10018("10018","短信码失效请用本机发送CXXD至10001获取查询详单的验证码"),//不会自动下发验证码，需要提示用户手动发送短信再获取验证码（吉林电信），跳转：4.1.4-2-2 一次验证 页面提示信息：短信验证码失效，请使用本机发送CXXD至10001重新获取查询详单的验证码
		CODE_10022("10022","输入查询密码"),//北京移动需要，跳转：4.2.4-2.4 查询密码（仅北京移动）
		CODE_10023("10023","查询密码错误"),//北京移动需要，停留在：4.2.4-2.4 查询密码（仅北京移动） 页面提示信息：查询密码错误，请重新输入
		CODE_30000("30000","网络异常、运营商异常"),//任何页面都可能出现 页面提示信息：运营商网络异常，请重试
		CODE_0("0","采集请求超时"),//需要重新授权，停留在当前页。 页面提示信息：未能授权成功，请重新授权
		/*
		CODE_65537("65537","机构账号不存在")

		CODE_65538("65538","机构账号已冻结")

		CODE_65539("65539","机构账号已过期")


		我们服务接口不能用，停留在4.1.4-2-1授权运营商认证

		页面提示信息：运营商授权暂时不能使用


		5


		CODE_65554("65554","手机号码不支持认证")


		停留在4.1.4-2-1授权运营商认证

		页面提示信息：该手机号码不支持认证


		5


		CODE_65555("65555","手机号码所在运营商正在维护")


		停留在4.1.4-2-1授权运营商认证

		页面提示信息：该手机号码所在运营商正在维护，请稍后再试


		5


		ERROR("ERROR","错误类型的响应结果")

		CONTROL("CONTROL","控制类型的响应结果")

		RUNNING("RUNNING","正在运行（超时会出现）")

		CODE_65556("65556","生成token失败")

		CODE_65557("65557","生成token成功")


		不管


		CODE_65540("65540","基本信息不能为空")

		CODE_65541("65541","身份证号码为空或身份证号码不合法")

		CODE_65542("65542","手机号码为空或手机号码不合法")

		CODE_65543("65543","姓名为空或姓名不合法")

		CODE_65544("65544","联系人姓名不合法")

		CODE_65545("65545","联系人手机号码不合法")

		CODE_65552("65552","联系人类型不合法")

		CODE_65553("65553","数据源名称不合法")
		*/
	}
}